In [32]:
import pandas as pd
df = pd.read_csv('1.csv', sep=';')

In [43]:
df

      club position  speed     Name
0  Spartak       GK      5    Vasya
1   Dynamo       PK      3    Petya
2     CSKA       VH      4    Kolya
3     CSKA       GK      2    Andre
4   Dynamo       VH      4  Nikanor
5  Spartak       VH      9    Tanya
6  Spartak       GK      2    Sveta
7  Spartak       MN     11     Kira
8   Dynamo       MN      2    Masha
9   Dynamo       GK      1   Rodion

In [44]:
df.pivot_table(index='club', columns='position', values='speed', aggfunc='mean')

position   GK    MN   PK   VH
club
CSKA      2.0   NaN  NaN  4.0
Dynamo    1.0   2.0  3.0  4.0
Spartak   3.5  11.0  NaN  9.0

In [62]:
df.pivot_table(index='club', columns='position', values='speed')

position   GK    MN   PK   VH
club
CSKA      2.0   NaN  NaN  4.0
Dynamo    1.0   2.0  3.0  4.0
Spartak   3.5  11.0  NaN  9.0

In [64]:
df2 = df.pivot_table(index='club', columns='position', values='speed', aggfunc='mean', margins=True)

In [55]:
df2

position   GK    MN   PK        VH   All
club
CSKA      2.0   NaN  NaN  4.000000  3.00
Dynamo    1.0   2.0  3.0  4.000000  2.50
Spartak   3.5  11.0  NaN  9.000000  6.75
All       2.5   6.5  3.0  5.666667  4.30

In [61]:
df2.loc['Dynamo']

position
GK     1.0
MN     2.0
PK     3.0
VH     4.0
All    2.5
Name: Dynamo, dtype: float64

In [58]:
df2['GK']

club
CSKA       2.0
Dynamo     1.0
Spartak    3.5
All        2.5
Name: GK, dtype: float64

In [59]:
df2['GK'].mean()

2.25

In [53]:
df2['MN'].mean()

6.5

In [57]:
df2['PK'].mean()

3.0